Autodesk.Revit.DB.OverrideGraphicSettings.SetCutBackgroundPatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the cut face background pattern override.
The fill pattern must be a drafting pattern.
A value of InvalidElementId means no override is set.
fillPatternId:
Value of the cut face background fill pattern override.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutForegroundPatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the cut face foreground pattern override.
The fill pattern must be a drafting pattern.
A value of InvalidElementId means no override is set.
fillPatternId:
Value of the cut face foreground fill pattern override.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceBackgroundPatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the surface background pattern override.
The fill pattern must be a drafting pattern.
A value of InvalidElementId means no override is set.
fillPatternId:
Value of the surface background fill pattern override.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceForegroundPatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the surface foreground pattern override.
The fill pattern must be a drafting pattern.
A value of InvalidElementId means no override is set.
fillPatternId:
Value of the surface foreground fill pattern override.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutBackgroundPatternColor(Autodesk.Revit.DB.Color)
Sets the override color of the background pattern of cut faces.
color:
Value of the cut face background color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutForegroundPatternColor(Autodesk.Revit.DB.Color)
Sets the override color of the foreground pattern of cut faces.
color:
Value of the cut face foreground color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceBackgroundPatternColor(Autodesk.Revit.DB.Color)
Sets the override color of the surface background pattern.
color:
Value of the surface background color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceForegroundPatternColor(Autodesk.Revit.DB.Color)
Sets the override color of the surface foreground pattern.
color:
Value of the surface foreground color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutBackgroundPatternVisible(System.Boolean)
Sets the visibility of the cut face background fill pattern.
fillPatternVisible:
Value of the visibility of the cut face background fill pattern.
Returns:
Reference to the changed object.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutForegroundPatternVisible(System.Boolean)
Sets the visibility of the cut face foreground fill pattern.
fillPatternVisible:
Value of the visibility of the cut face foreground fill pattern.
Returns:
Reference to the changed object.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceBackgroundPatternVisible(System.Boolean)
Sets the visibility of the surface background fill pattern.
fillPatternVisible:
Value of the visibility of the surface background fill pattern.
Returns:
Reference to the changed object.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceForegroundPatternVisible(System.Boolean)
Sets the visibility of the surface foreground fill pattern.
fillPatternVisible:
Value of the visibility of the surface foreground fill pattern.
Returns:
Reference to the changed object.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutFillPatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the cut face foreground pattern.
fillPatternId:
ElementId of the cut face foreground fill pattern for the override. InvalidElementId means no override is set. The pattern must be a drafting pattern.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutFillColor(Autodesk.Revit.DB.Color)
Sets the color of the foreground pattern of cut faces.
color:
Value of the Cut face foreground pattern color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutFillPatternVisible(System.Boolean)
Sets the visibility of the cut surface fill pattern.
cutFillPatternVisible:
Value of the visibility of the cut surface fill pattern.
Returns:
Reference to the changed object.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutLinePatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the cut surface line pattern.
linePatternId:
ElementId of the cut surface line pattern for the override. InvalidElementId means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutLineColor(Autodesk.Revit.DB.Color)
Sets the cut surface line color.
color:
Value of the cut surface line color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetCutLineWeight(System.Int32)
Sets the cut surface line weight.
lineWeight:
Value of the cut surface line weight for the override. InvalidPenNumber means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Line weight must be a positive integer less than 17 or invalidPenNumber.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetSurfaceTransparency(System.Int32)
Sets the projection surface transparency.
transparency:
Value of the transparency of the projection surface (0 = opaque, 100 = fully transparent).
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Transparency must be greater than 0 and less than 100.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetProjectionFillPatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the surface foreground pattern.
fillPatternId:
ElementId of the surface foreground fill pattern for the override. InvalidElementId means no override is set. The pattern must be a drafting pattern.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetProjectionFillColor(Autodesk.Revit.DB.Color)
Sets the color of the surface foreground pattern.
color:
Value of the surface foreground pattern color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetProjectionFillPatternVisible(System.Boolean)
Sets the visibility of the projection surface fill pattern.
projectFillPatternVisible:
Value of the visibility of the projection surface fill pattern.
Returns:
Reference to the changed object.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetProjectionLinePatternId(Autodesk.Revit.DB.ElementId)
Sets the ElementId of the projection surface line pattern.
linePatternId:
ElementId of the projection surface line pattern for the override. InvalidElementId means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetProjectionLineColor(Autodesk.Revit.DB.Color)
Sets the projection surface line color.
color:
Value of the projection surface line color for the override. InvalidColorValue means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetProjectionLineWeight(System.Int32)
Sets the projection surface line weight.
lineWeight:
Value of the projection surface line weight for the override. InvalidPenNumber means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Line weight must be a positive integer less than 17 or invalidPenNumber.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetDetailLevel(Autodesk.Revit.DB.ViewDetailLevel)
Sets the detail level.
detailLevel:
Value of the detail level. ViewDetailLevel.Undefined means no override is set.
Returns:
Reference to the changed object.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.SetHalftone(System.Boolean)
Sets the halftone value.
halftone:
True if the override displays in halftone, false otherwise.
Returns:
Reference to the changed object.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.InvalidPenNumber
The invalidPenNumber for clearing line weight overrides.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.CutBackgroundPatternId
The ElementId of the cut face background fill pattern override.
A value of InvalidElementId means no override is set.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.CutForegroundPatternId
The ElementId of the cut face foreground fill pattern override.
A value of InvalidElementId means no override is set.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SurfaceBackgroundPatternId
The ElementId of the surface background fill pattern override.
A value of InvalidElementId means no override is set.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SurfaceForegroundPatternId
The ElementId of the surface foreground fill pattern override.
A value of InvalidElementId means no override is set.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.CutBackgroundPatternColor
The override color of the background pattern of cut faces.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.CutForegroundPatternColor
The override color of the foreground pattern of cut faces.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SurfaceBackgroundPatternColor
The override color of the surface background pattern.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.SurfaceForegroundPatternColor
The override color of the surface foreground pattern.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.IsCutBackgroundPatternVisible
The visibility of the cut face background fill pattern.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.IsCutForegroundPatternVisible
The visibility of the cut face foreground fill pattern.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.IsSurfaceBackgroundPatternVisible
The visibility of the surface background fill pattern.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.IsSurfaceForegroundPatternVisible
The visibility of the surface foreground fill pattern.
Since:
2019

Autodesk.Revit.DB.OverrideGraphicSettings.CutFillPatternId
The ElementId of the foreground fill pattern of cut faces.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.CutFillColor
The color of the cut face foreground pattern.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.IsCutFillPatternVisible
Visibility of the cut surface fill pattern.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.CutLinePatternId
ElementId of the cut surface line pattern.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.CutLineColor
Cut surface line color.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.CutLineWeight
Cut surface line weight.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.Transparency
Transparency of surfaces.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.ProjectionFillPatternId
The ElementId of the surface foreground fill pattern.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.ProjectionFillColor
The color of the surface foreground pattern.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.IsProjectionFillPatternVisible
The visibility of the projection surface fill pattern.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.ProjectionLinePatternId
Id of the projection surface line pattern.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.ProjectionLineColor
Projection surface line color.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.ProjectionLineWeight
The projection surface line weight.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.DetailLevel
The detail level.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.Halftone
Value of the halftone override.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.#ctor(Autodesk.Revit.DB.OverrideGraphicSettings)
Creates a new instance of an OverrideGraphicSettings object based on an existing OverrideGraphicSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings.#ctor
Creates a new instance of an OverrideGraphicSettings object.
Since:
2014

Autodesk.Revit.DB.OverrideGraphicSettings
Settings to override display of elements in a view.
Since:
2014